Reports/СводныйУправленческийОтчетПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>СводныйУправленческийОтчетПроизводства</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/ВыработкаПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ВыработкаПроизводства</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказНаПроизводство</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/РасходМатериаловНаПроизводстве.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>РасходМатериаловНаПроизводстве</Name>
			<Comment>Расход материалов на производстве</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоВБазовыхЕдиницах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументСписания</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыпускПродукции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Продукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЗаказыНаПроизводство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыНаПроизводство</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОжидаемаяДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаказНаПроизводство</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фактура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фактура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦветФактуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦветФактуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/СводныйУправленческийОтчетПроизводства/Forms/УДАЛИТЬ_ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.Год = Год(ТекущаяДатаСеанса());
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	// ПРИМЕЧАНИЕ: в случае изменения запроса надо сверить запрос для динамического списка 
	// в ФормеСпискаРасшифровка документа ЗаказНаПроизводствоД
	// там используется аналогичный запрос
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказНаПроизводствоДокумент.Ссылка,
	|	ЗаказНаПроизводствоДокумент.Подразделение КАК Подразделение,
	|	ВЫБОР
	|			КОГДА &ПоДатеПроизводства
	|				ТОГДА МЕСЯЦ(ЗаказНаПроизводствоДокумент.Дата)
	|			ИНАЧЕ МЕСЯЦ(ЗакНаПроОбороты.Регистратор.Дата) 
	|	КОНЕЦ КАК Месяц,
	|	ЕСТЬNULL(ЗаказНаПроизводствоДокумент.ПродукцияНоменклатураКоличество, 0) КАК КоличествоПроизведено,
	|	ЕСТЬNULL(ВыработкаПроизводстваОбороты.КоличествоОборот, 0) КАК КоличествоВыработка,
	|	ВЫБОР
	|		КОГДА РасходМатериаловНаПроизводствеОбороты.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерений
	|			ТОГДА ЕСТЬNULL(РасходМатериаловНаПроизводствеОбороты.ЕдиницаИзмерения.Коэффициент * РасходМатериаловНаПроизводствеОбороты.КоличествоОборот, 0)
	|		ИНАЧЕ ЕСТЬNULL(РасходМатериаловНаПроизводствеОбороты.КоличествоОборот, 0)
	|	КОНЕЦ КАК КоличествоПленки,
	|	ВЫБОР
	|		КОГДА РасходМатериаловНаПроизводствеОбороты1.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерений
	|			ТОГДА ЕСТЬNULL(РасходМатериаловНаПроизводствеОбороты1.ЕдиницаИзмерения.Коэффициент * РасходМатериаловНаПроизводствеОбороты1.КоличествоОборот, 0)
	|		ИНАЧЕ ЕСТЬNULL(РасходМатериаловНаПроизводствеОбороты1.КоличествоОборот, 0)
	|	КОНЕЦ КАК КоличествоОстатка,
	|	ЕСТЬNULL(ЗаказНаПроизводствоДокумент.ПродукцияСумма, 0) КАК СтоимостьПотолков,
	|	ЗаказНаПроизводствоДокумент.Услуги.(
	|		Сумма
	|	) КАК ТаблицаУслуг,
	|	ЗакНаПроОбороты.КоличествоРасход КАК КоличествоПроизведеноФакт
	|ИЗ
	|	Документ.ЗаказНаПроизводство КАК ЗаказНаПроизводствоДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыработкаПроизводства.Обороты(, , Регистратор, ) КАК ВыработкаПроизводстваОбороты
	|		ПО ЗаказНаПроизводствоДокумент.Ссылка = ВыработкаПроизводстваОбороты.ЗаказНаПроизводство
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасходМатериаловНаПроизводстве.Обороты(
	|				,
	|				,
	|				Регистратор,
	|				Номенклатура.ВидНоменклатуры В (&ПолотноИОстатокПленки)
	//|					И Номенклатура <> &Остаток
	|					) КАК РасходМатериаловНаПроизводствеОбороты
	|		ПО ЗаказНаПроизводствоДокумент.ПродукцияНоменклатура = РасходМатериаловНаПроизводствеОбороты.Регистратор.ПродукцияНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасходМатериаловНаПроизводстве.Обороты(, , Регистратор, Номенклатура = &Остаток 
	|																				ИЛИ Номенклатура.ВидНоменклатуры = Значение(Справочник.ВидыНоменклатуры.ОстатокПленки)
	|																				) КАК РасходМатериаловНаПроизводствеОбороты1
	|		ПО ЗаказНаПроизводствоДокумент.ПродукцияНоменклатура = РасходМатериаловНаПроизводствеОбороты1.Регистратор.ПродукцияНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыНаПроизводство.Обороты(,, Регистратор) КАК ЗакНаПроОбороты
	|		ПО ЗаказНаПроизводствоДокумент.Ссылка = ЗакНаПроОбороты.ЗаказНаПроизводство
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ПоДатеПроизводства
	|				ТОГДА ГОД(ЗаказНаПроизводствоДокумент.Дата) = &Год
	|			ИНАЧЕ ГОД(ЗакНаПроОбороты.Регистратор.Дата) = &Год
	|		КОНЕЦ
	|	И ЗаказНаПроизводствоДокумент.Проведен = ИСТИНА
	//Начало изменен при переходе на 2.0
	//|	И ЗаказНаПроизводствоДокумент.ТекущийСтатус = &Отгружен
	|	И ЗаказНаПроизводствоДокумент.ТекущийСтатус = &Произведен
	//Конец изменен при переходе на 2.0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подразделение,
	|	Месяц";
	
	// |	И Месяц(ЗаказНаПроизводствоДокумент.Дата) = &Мс
	// Запрос.УстановитьПараметр("Мс",4);
	Запрос.УстановитьПараметр("Год",Отчет.Год);
	//Начало изменен при переходе на 2.0
	//Запрос.УстановитьПараметр("Отгружен",Справочники.СтатусыЗаказовНаПроизводство.Отгружен);
	Запрос.УстановитьПараметр("Произведен", Справочники.СтатусыЗаказовНаПроизводство.Произведен);
	//Конец изменен при переходе на 2.0
	МассивВидовНоменклатурПолотна = Новый Массив;
	МассивВидовНоменклатурПолотна.Добавить(Справочники.ВидыНоменклатуры.Полотно);
	МассивВидовНоменклатурПолотна.Добавить(Справочники.ВидыНоменклатуры.ОстатокПленки);
	Запрос.УстановитьПараметр("ПолотноИОстатокПленки", МассивВидовНоменклатурПолотна);
	Запрос.УстановитьПараметр("Остаток",Справочники.Номенклатура.ОстаткиПленки);
	Запрос.УстановитьПараметр("ПоДатеПроизводства", ?(ВариантОтчета = 0, Истина, Ложь));
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();	
	РезультатЗапроса.Колонки.Добавить("СтоимостьУслуг", Новый ОписаниеТипов("число"));
	РезультатЗапроса.Колонки.Добавить("СтоимостьПотолковИУслуг", Новый ОписаниеТипов("число"));
		
	Для Каждого ТекущийЗаказ Из РезультатЗапроса Цикл
		Если ТекущийЗаказ.Ссылка.Валюта = Константы.ВалютаУчета.Получить() Тогда
			ТекущийЗаказ.СтоимостьУслуг = ТекущийЗаказ.ТаблицаУслуг.Итог("Сумма");
			ТекущийЗаказ.СтоимостьПотолковИУслуг = ТекущийЗаказ.СтоимостьПотолков + ТекущийЗаказ.СтоимостьУслуг;
		Иначе
			ОтборВалют = Новый Структура ("Валюта", ТекущийЗаказ.Ссылка.Валюта);
			КурсВалютыДокумента = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ТекущийЗаказ.Ссылка.Дата, ОтборВалют);
			Если КурсВалютыДокумента.Кратность = 0 Тогда
				ТекстСообщения = "Для валюты %1 на дату %2 не задан курс или указана Кратность = 0! Документ: %3";
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Строка(ОтборВалют.Валюта), Формат(ТекущийЗаказ.Ссылка.Дата, "ДЛФ=D"), Строка(ТекущийЗаказ.Ссылка));
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Возврат;
			Иначе
				ТекущийЗаказ.СтоимостьУслуг = ТекущийЗаказ.ТаблицаУслуг.Итог("Сумма") * КурсВалютыДокумента.Курс / КурсВалютыДокумента.Кратность;
				ТекущийЗаказ.СтоимостьПотолков = ТекущийЗаказ.СтоимостьПотолков * КурсВалютыДокумента.Курс / КурсВалютыДокумента.Кратность;
				ТекущийЗаказ.СтоимостьПотолковИУслуг = ТекущийЗаказ.СтоимостьПотолков + ТекущийЗаказ.СтоимостьУслуг;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	РезультатЗапроса.Свернуть("Подразделение, Месяц","КоличествоПроизведено, КоличествоПроизведеноФакт, КоличествоВыработка, КоличествоПленки, КоличествоОстатка, СтоимостьПотолков, СтоимостьУслуг, СтоимостьПотолковИУслуг");
	
	РезультатЗапроса.Колонки.Добавить("КоэффициентКоличествоПроизведеноКоличествоВыработка", Новый ОписаниеТипов("число"));
	РезультатЗапроса.Колонки.Добавить("КоэффициентКоличествоПленкаКоличествоПроизведено", Новый ОписаниеТипов("число"));
	РезультатЗапроса.Колонки.Добавить("КоэффициентКоличествоПленкаИОстатокКоличествоПроизведено", Новый ОписаниеТипов("число"));
	РезультатЗапроса.Колонки.Добавить("ПроцентПриростаПроизводства", Новый ОписаниеТипов("число"));
	РезультатЗапроса.Колонки.Добавить("СредняяЦенаПотолков", Новый ОписаниеТипов("число"));
	РезультатЗапроса.Колонки.Добавить("СредняяЦенаПотолковСУслугами", Новый ОписаниеТипов("число"));
	РезультатЗапроса.Колонки.Добавить("СредняяЦенаУслуг", Новый ОписаниеТипов("число"));
	НомерСтрокиВТаблице = 0;
	Для Каждого СтрокаРезультата Из РезультатЗапроса Цикл
		Если НЕ СтрокаРезультата.КоличествоВыработка = 0 Тогда
			СтрокаРезультата.КоэффициентКоличествоПроизведеноКоличествоВыработка = Окр((СтрокаРезультата.КоличествоПроизведено / СтрокаРезультата.КоличествоВыработка)-1,4);
		КонецЕсли;
		Если НЕ СтрокаРезультата.КоличествоПроизведено = 0 Тогда
			СтрокаРезультата.КоэффициентКоличествоПленкаКоличествоПроизведено = Окр((СтрокаРезультата.КоличествоПленки / СтрокаРезультата.КоличествоПроизведено)-1,4);
			СтрокаРезультата.КоэффициентКоличествоПленкаИОстатокКоличествоПроизведено = Окр(((СтрокаРезультата.КоличествоПленки + СтрокаРезультата.КоличествоОстатка) / СтрокаРезультата.КоличествоПроизведено)-1,4);
			
			СтрокаРезультата.СредняяЦенаПотолков = Окр(СтрокаРезультата.СтоимостьПотолков / СтрокаРезультата.КоличествоПроизведено,2);
			СтрокаРезультата.СредняяЦенаПотолковСУслугами = Окр(СтрокаРезультата.СтоимостьПотолковИУслуг / СтрокаРезультата.КоличествоПроизведено,2);
			СтрокаРезультата.СредняяЦенаУслуг = Окр(СтрокаРезультата.СтоимостьУслуг / СтрокаРезультата.КоличествоПроизведено,2);
		КонецЕсли;
		Если НомерСтрокиВТаблице > 0 Тогда
			ПроизведеноВПрошломМесяце = РезультатЗапроса[НомерСтрокиВТаблице-1].КоличествоПроизведено;
			ПроизведеноВЭтомМесяце = СтрокаРезультата.КоличествоПроизведено;
			Если НЕ ПроизведеноВПрошломМесяце = 0 Тогда
				СтрокаРезультата.ПроцентПриростаПроизводства = Окр(((ПроизведеноВЭтомМесяце / ПроизведеноВПрошломМесяце) * 100) - 100,2);
			КонецЕсли;
		КонецЕсли;
		НомерСтрокиВТаблице = НомерСтрокиВТаблице + 1;
	КонецЦикла;
	
	
	Таб = Новый ТабличныйДокумент;
	Таб.НачатьАвтогруппировкуСтрок();
	ЭтотОтчет = РеквизитФормыВЗначение("Отчет");
	Макет = ЭтотОтчет.ПолучитьМакет("УДАЛИТЬ_Макет");
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Год = Формат(Отчет.Год, "ЧГ=0");
	ОбластьМакета.Параметры.Валюта = Константы.ВалютаУчета.Получить();
	Таб.Вывести(ОбластьМакета);
	
	ТЗ = РезультатЗапроса.Скопировать();
	ТЗ.Свернуть("Подразделение","КоличествоПроизведено, КоличествоПроизведеноФакт, КоличествоВыработка, КоличествоПленки, КоличествоОстатка, СтоимостьПотолков, СтоимостьУслуг, СтоимостьПотолковИУслуг,
	|КоэффициентКоличествоПроизведеноКоличествоВыработка,КоэффициентКоличествоПленкаКоличествоПроизведено,КоэффициентКоличествоПленкаИОстатокКоличествоПроизведено,
	|ПроцентПриростаПроизводства,СредняяЦенаПотолков,СредняяЦенаПотолковСУслугами,СредняяЦенаУслуг");
	
	Производство = Справочники.Подразделения.ПустаяСсылка();
	Для Каждого ТекущаяСтрока Из РезультатЗапроса Цикл
		Если не Производство = ТекущаяСтрока.Подразделение Тогда 			
			Область = Макет.ПолучитьОбласть("СтрокаПроизводство");
			Для Каждого Стр Из ТЗ Цикл
				Если ТекущаяСтрока.Подразделение = Стр.Подразделение Тогда
					//++ исправление по заявке 4095
					Если НЕ Стр.КоличествоВыработка = 0 Тогда
						Стр.КоэффициентКоличествоПроизведеноКоличествоВыработка = Окр((Стр.КоличествоПроизведено / Стр.КоличествоВыработка)-1,4);
					КонецЕсли;
					Если НЕ Стр.КоличествоПроизведено = 0 Тогда
						Стр.КоэффициентКоличествоПленкаКоличествоПроизведено = Окр((Стр.КоличествоПленки / Стр.КоличествоПроизведено)-1,4);
						Стр.КоэффициентКоличествоПленкаИОстатокКоличествоПроизведено = Окр(((Стр.КоличествоПленки + Стр.КоличествоОстатка) / Стр.КоличествоПроизведено)-1,4);
						
						Стр.СредняяЦенаПотолков = Окр(Стр.СтоимостьПотолков / Стр.КоличествоПроизведено,2);
						Стр.СредняяЦенаПотолковСУслугами = Окр(Стр.СтоимостьПотолковИУслуг / Стр.КоличествоПроизведено,2);
						Стр.СредняяЦенаУслуг = Окр(Стр.СтоимостьУслуг / Стр.КоличествоПроизведено,2);
					КонецЕсли;
				    //-- исправление по заявке 4095
					
					ЗаполнитьЗначенияСвойств(Область.Параметры, Стр);					
					
					//передаем данные для расшифровки
					Структура = Новый Структура;                                      
					Структура.Вставить("Подразделение", ТекущаяСтрока.Подразделение); 
					Область.Параметры.РасшифровкаСтрокиПроизводство = Структура;                  
					
					Таб.Вывести(Область,2,"Производство",Истина);
				КонецЕсли;				
			КонецЦикла;
		КонецЕсли;
				
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяСтрока);
		// выводим название месяца, а не цифру
		ОбластьМакета.Параметры.Месяц = Формат(Дата(2000, ТекущаяСтрока.Месяц, 1), "ДФ=ММММ"); 
		  
		// передаем данные для расшифровки
		Структура = Новый Структура;                                      
		Структура.Вставить("Подразделение", ТекущаяСтрока.Подразделение); 
		Структура.Вставить("Месяц", ТекущаяСтрока.Месяц); 
		ОбластьМакета.Параметры.РасшифровкаСтроки = Структура;                  
		
		Таб.Вывести(ОбластьМакета,3,"Месяц");
		Производство = ТекущаяСтрока.Подразделение;
	КонецЦикла;
	
	Таб.ЗакончитьАвтогруппировкуСтрок();
	
	РезультатЗапроса.Свернуть("Месяц","КоличествоПроизведено, КоличествоПроизведеноФакт, КоличествоВыработка, КоличествоПленки, КоличествоОстатка, СтоимостьПотолков, СтоимостьУслуг, СтоимостьПотолковИУслуг");
	
	ОбластьМакета = Макет.ПолучитьОбласть("График");
	Диаграмма = ОбластьМакета.Рисунки.D1.Объект;
	Диаграмма.Обновление = ложь;
		
	Диаграмма.Точки.Добавить("Январь");
	Диаграмма.Точки.Добавить("Февраль");
	Диаграмма.Точки.Добавить("Март");
	Диаграмма.Точки.Добавить("Апрель");
	Диаграмма.Точки.Добавить("Май");
	Диаграмма.Точки.Добавить("Июнь");
	Диаграмма.Точки.Добавить("Июль");
	Диаграмма.Точки.Добавить("Август");
	Диаграмма.Точки.Добавить("Сентябрь");
	Диаграмма.Точки.Добавить("Октябрь");
	Диаграмма.Точки.Добавить("Ноябрь");
	Диаграмма.Точки.Добавить("Декабрь");
	
	Диаграмма.Серии.Добавить("Выпуск");
	
	// заполняем пустыми значеними если результат запроса пустой
	Если НЕ РезультатЗапроса.Количество() Тогда
		Для Счетчик = 0 По 11 Цикл
			Диаграмма.УстановитьЗначение(Счетчик,0,0);	
		КонецЦикла; 
	КонецЕсли;
   
	Для Каждого СтрокаСерии Из РезультатЗапроса Цикл
		Значение = СтрокаСерии.КоличествоПроизведено;
		Диаграмма.УстановитьЗначение(СтрокаСерии.Месяц-1,0,Значение,,Значение);
	КонецЦикла;
		
	Диаграмма.Обновление = Истина;
	Таб.Вывести(ОбластьМакета);
	
	
	Результат.Очистить();
	Результат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОтчетСводныйУправленческийОтчетПроизводства";
	Результат.Вывести(Таб);
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Состояние("Идет формирование отчета...");
	СформироватьНаСервере();
	Состояние("Отчет сформирован.");
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	// обработка расшифровки 
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("Год, Подразделение, ОтборПоМесяцу, ПоДатеПроизводства", Отчет.Год, Расшифровка.Подразделение, Ложь, ?(ВариантОтчета = 0, Истина, Ложь));
	Если Расшифровка.Свойство("Месяц") Тогда
		 ПараметрыФормы = Новый Структура("Год, Подразделение, ОтборПоМесяцу, Месяц, ПоДатеПроизводства", Отчет.Год, Расшифровка.Подразделение, Истина, Расшифровка.Месяц, ?(ВариантОтчета = 0, Истина, Ложь));
	КонецЕсли;
		 
	Форма = ПолучитьФорму("Документ.ЗаказНаПроизводство.Форма.ФормаСпискаРасшифровка", ПараметрыФормы); 
	Форма.Открыть();	
КонецПроцедуры
